//Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.

//ввод числа №1Console.Write("Введите число №1:
{
     
}